RomuloGatto/microlink/examples/modem_watchdog/sdkconfig.defaults
# Modem Watchdog - classic ESP32 / WROOM
CONFIG_IDF_TARGET="esp32"

# Keep the no-PSRAM WROOM footprint conservative.
CONFIG_ML_H2_BUFFER_SIZE_KB=64
CONFIG_ML_MAX_PEERS=8
CONFIG_ML_NVS_MAX_PEERS=32

# We provide our own port-80 watchdog UI.
CONFIG_ML_ENABLE_CONFIG_HTTPD=n

# Tailscale subnet-router support from this fork.
CONFIG_ML_ENABLE_SUBNET_ROUTER=y
CONFIG_ML_SUBNET_ROUTE=""

# lwIP / WireGuard.
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=16384
CONFIG_LWIP_TCP_WND_DEFAULT=16384

# mbedTLS / Noise.
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y

# CPU / task watchdog.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# App partition.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Logging.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
